export default `

# 一个记录作品的博客的设计图纸

## 写在项目开始之前

之所以开始这个项目，有两个目的：一是为了记录自己学习的点滴，比如将平时的手绘、PS&AI练习的成果、板绘等整合起来，可以用来查看分析自己的水平和学习进度；二是帮助自己在通往设计师的学习之路上，提高审美能力、设计水平、WEB前端技能。

## 设计过程

这是一个人个人网站，用来展示一些作品，内容也是相对比较少，因此比较适合用简洁的风格来突出作品。虽然一开始用了偏红的较为强烈的色调，但是后期又改为浅灰色的相对简约的风格了。

![文章用图1](https://wx4.sinaimg.cn/large/65f02d4egy1fqcdjmb5okj21kw0mq7er.jpg)

![文章用图2](https://wx2.sinaimg.cn/large/65f02d4egy1fqcdjnox5uj21kw0mfamg.jpg)

这是一开始设计的样式，后来网站建立出来后，觉得不太适合，于是又重新修改了一些东西。删掉了不必要的元素：导航上的三个按钮，只保留了一个不是必须的按钮“ABOUT ME”，这个在不需要时隐藏界面，然后将其余内容都体现在一个首页上，这样可以让访问者一目了然，只需在首页上点击感兴趣的内容即可，节省时间。另外又调整了各个分辨率下页面的高度宽度等数据。

![文章用图3](https://wx1.sinaimg.cn/large/65f02d4egy1fqcdjp1cuij20pe0e3apn.jpg)

网页的功能较少，主要作用是呈现作品，因此，所需的元素也不是很多。banner是图片加文字的老套设计，所以还是要找好看的图片啦。虽然想自己画，但是效果不是很好。先暂定了几张图片。LOGO是自己画的，猫咪的剪影加S字母，不复杂，意义也简单，加有爱猫嘛。

其实也是修改了很多遍的，像是不断调整分辨率大小，增加元素或是删去元素及不必要的内容，还有些以程序员在编辑网站时比较容易达到的效果为主。

## 总结经验

这次的项目比想象中花的时间长，不断有新的想法出现，又不断被推翻，总是在各种各样的情况下才发现：哦，这样不行呀，不好看呀，不合理呀，等等等。但然，上传的作品也不成熟，缺少大量的练习，和认真的思考。总之，这一步已经迈出去了，虽然万事开头难，然后中间难，最后结尾难，但是事情肯定会像更好的方向发展。

![文章用图3](https://wx3.sinaimg.cn/large/65f02d4egy1fqcdjq238fj20rd0dz76e.jpg)


`;
